{
  "architectures": [
    "SegformerForImageSegmentation"
  ],
  "model_type": "segformer",
  "num_labels": 2,
  "id2label": {
    "0": "background",
    "1": "foreground"
  },
  "label2id": {
    "background": 0,
    "foreground": 1
  },
  "reshape_last_stage": false,
  "classifier_dropout": 0.1,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "decoder_hidden_size": 256,
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "depths": [
    2,
    2,
    2,
    2
  ],
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "in_ch": 3,
  "out_ch": 1
}